# Taps
tap 'homebrew/cask'
#tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie' # curl replacement
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'zlib' # Needed for Memcached
brew 'zsh'

# Spatie Medialibrary
#brew 'jpegoptim'
#brew 'optipng'
#brew 'pngquant'
#brew 'svgo'
#brew 'gifsicle'

# Development
brew 'php'
brew 'composer'
brew 'node'
brew 'openssl'
brew 'tmux'
brew 'python'
brew 'unrar'
brew 'wget'

# Apps
cask '1password'
cask '1password-cli'
cask 'amazon-workspaces'
cask 'bettertouchtool'
cask 'discord'
#cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
#cask 'intellij-idea'
cask 'istat-menus'
cask 'iterm2'
#cask 'java'
#cask 'karabiner-elements'
cask 'keybase'
cask 'mysqlworkbench'
#cask 'n'
cask 'nordvpn'
cask 'postman'
cask 'sequel-ace'
#cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
#cask 'sublime-text'
cask 'tableplus'
cask 'the-unarchiver'
#cask 'twitch'
cask 'vagrant'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-inconsolata'
cask 'font-meslo-lg'
cask 'font-meslo-for-powerline'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Giphy Capture', id: 668208984
mas 'Pixelmator', id: 407963104
#mas 'NordVPN IKE', id: 1116599239
#mas 'Trello', id: 1278508951
mas 'HP Easy Scan', id: 967004861
mas 'Ka-Block!' id: 1335413823
